Project/Toir/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <comment> //TOIR20-370: включенно индексирование для ДатаНачала и ДатаОкончания</comment>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.торо_ДокументыПлановыхДатРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ЭтоПереносРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <comment> //TOIR20-370: включенно индексирование для ID и ПлановаяДатаРемонта</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <comment>Не используется! РемонтыОборудования_ID искать в измерении ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Содержит РемонтыОборудования_ID, несмотря на реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>гкс_КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СкользящийПланРегламентныхМероприятий/торо_СкользящийПланРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СкользящийПланРегламентныхМероприятий</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>БазовыйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.торо_ВидыСкользящихПланов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаБазовогоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияБазовогоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтсчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID_Ремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОстановочныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отвязан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>IDОсновного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDЗависимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_ПланированиеРемонтов/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПодпискиНаСобытия

Процедура торо_ОбновитьПлановыеДатыПриПроведенииОбработчик(Источник) Экспорт
	
	СтруктураДанныхРемонтов = ПолучитьМассивIDРемонтов(Источник);
	Если СтруктураДанныхРемонтов = Неопределено Тогда
		Возврат;
	КонецЕсли;;
	
	МассивID = СтруктураДанныхРемонтов.МассивID;
	УстановитьУправляемыеБлокировкиНаРегистрАктуальныхДат(СтруктураДанныхРемонтов.ТаблицаРемонтов);
	
	// Для случая, если документ перепроводится, при этом какой-то ремонт из документа удалили, 
	// и больше никаких документов по тому ремонту не было.
	// Чтобы он не остался висеть в регистре, очистим записи.
	УдалитьПлановыеДатыРемонтовПоДокументуНачалаЦепочки(Источник.Ссылка);
	ТекущиеЗаписиРегистра = ПолучитьАктуальныеДатыРемонтов(МассивID);
	
	Источник.Движения.Записать();
	ОбновитьАктуальныеПлановыеДатыРемонтов(МассивID, Источник.Ссылка, ТекущиеЗаписиРегистра);
	
КонецПроцедуры

Процедура торо_ОбновитьПлановыеДатыПриОтменеПроведенияОбработчик(Источник) Экспорт
	
	СтруктураДанныхРемонтов = ПолучитьМассивIDРемонтов(Источник);
	Если СтруктураДанныхРемонтов = Неопределено Тогда
		Возврат;
	КонецЕсли;;
	
	МассивID = СтруктураДанныхРемонтов.МассивID;
	УстановитьУправляемыеБлокировкиНаРегистрАктуальныхДат(СтруктураДанныхРемонтов.ТаблицаРемонтов);

	УдалитьПлановыеДатыРемонтовПоДокументуНачалаЦепочки(Источник.Ссылка);
	ТекущиеЗаписиРегистра = ПолучитьАктуальныеДатыРемонтов(МассивID);
	
	Для каждого НаборЗаписей из Источник.Движения Цикл
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записывать = Истина;
		КонецЕсли;
	КонецЦикла;
	Источник.Движения.Записать();
	
	ОбновитьАктуальныеПлановыеДатыРемонтов(МассивID, Источник.Ссылка, ТекущиеЗаписиРегистра);
	
КонецПроцедуры

#КонецОбласти

// Получает записи регистра торо_АктуальныеПлановыеДатыРемонтов.
//
// Параметры:
//		МассивID - Массив - массив идентификаторов ремонтов.
//
// Возвращаемое значение:
//		ТаблицаЗначений - таблица, состав колонок повторяет структуру регистра.
//								Таблица проиндексирована по IDРемонта.
//
Функция ПолучитьАктуальныеДатыРемонтов(МассивID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК IDРемонта,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК ДокументОснование,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки
	|ИЗ
	|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В(&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Результат.Индексы.Добавить("IDРемонта");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Процедура для обработчика обновления для начального заполнения регистра.  
// Заполняет даты ремонтов по внешним основаниям и выявленным дефектам.
// Параметр "Параметры" добавлен, т.к. он обязательен для отложенных обработчиков. 
Процедура ЗаполнитьРегистрАктуальныхПлановыхДат_ВОиВД(Параметры = Неопределено) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВнешниеОснованияДляРабот.ID КАК IDРемонта,
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ВнешниеОснования
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|ГДЕ
	|	торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК IDРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания,
	|	торо_ВыявленныеДефектыСрезПоследних.КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_Дефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты) КАК торо_ВыявленныеДефектыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВнешниеОснования.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ВнешниеОснования.IDРемонта КАК IDРемонта,
	|	ВТ_ВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Дефекты.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Дефекты.ДатаОкончания ЕСТЬ NULL
	|				И ВТ_Дефекты.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Дефекты.ДатаОкончания
	|		ИНАЧЕ ВТ_ВнешниеОснования.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_Дефекты.ДокументНачалаЦепочки, ВТ_ВнешниеОснования.ДокументНачалаЦепочки) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дефекты КАК ВТ_Дефекты
	|		ПО ВТ_ВнешниеОснования.IDРемонта = ВТ_Дефекты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВТ_ВнешниеОснования.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Дефекты.ДокументНачалаЦепочки,
	|	ВТ_Дефекты.IDРемонта,
	|	ВТ_Дефекты.ОбъектРемонта,
	|	ВТ_Дефекты.ДатаНачала,
	|	ВТ_Дефекты.ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения,
	|	ВТ_Дефекты.ДокументНачалаЦепочки
	|ИЗ
	|	ВТ_Дефекты КАК ВТ_Дефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ПО ВТ_Дефекты.IDРемонта = ВТ_ВнешниеОснования.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВТ_Дефекты.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	ВТ_ВнешниеОснования.IDРемонта ЕСТЬ NULL
	|	И торо_АктуальныеПлановыеДатыРемонтов.IDРемонта ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";
	
	Запрос.Выполнить();
	СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаНачала, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ЕСТЬNULL(ВТ_Заявки.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала))) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаОкончания, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ЕСТЬNULL(ВТ_Заявки.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания))) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.КрайняяДатаЗавершения, ВТ_ДатыИсходные.КрайняяДатаЗавершения) КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДокументОснование, ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ЕСТЬNULL(ВТ_Заявки.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование))) КАК ДокументОснование
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановочныеРемонты КАК ВТ_ОстановочныеРемонты
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_ОстановочныеРемонты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписатьВыборкуВРегистрСОбработкойОшибок(Выборка, Параметры);
	
КонецПроцедуры

// Процедура для обработчика обновления для начального заполнения регистра.  
// Заполняет даты ремонтов по графикам ППР.
// Параметр "Параметры" добавлен, т.к. он обязательен для отложенных обработчиков. 
Процедура ЗаполнитьРегистрАктуальныхПлановыхДат_ППР(Параметры = Неопределено) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ID КАК IDРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПервых
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПервых(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПервых
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК IDРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПоследних
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	|				ИЛИ Регистратор ССЫЛКА Документ.торо_ЗакрытиеЗаявокИРемонтов) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ГрафикСрезПервых.IDРемонта КАК IDРемонта,
	|	ВТ_ГрафикСрезПервых.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаНачала, ВТ_ГрафикСрезПервых.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаОкончания, ВТ_ГрафикСрезПервых.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДокументОснование, ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ГрафикСрезПервых КАК ВТ_ГрафикСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрафикСрезПоследних КАК ВТ_ГрафикСрезПоследних
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = ВТ_ГрафикСрезПоследних.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";
	
	Запрос.Выполнить();
	СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаНачала, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ЕСТЬNULL(ВТ_Заявки.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала))) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаОкончания, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ЕСТЬNULL(ВТ_Заявки.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания))) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.КрайняяДатаЗавершения, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДокументОснование, ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ЕСТЬNULL(ВТ_Заявки.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование))) КАК ДокументОснование
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановочныеРемонты КАК ВТ_ОстановочныеРемонты
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_ОстановочныеРемонты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписатьВыборкуВРегистрСОбработкойОшибок(Выборка, Параметры);
	
КонецПроцедуры

// Процедура для обработчика обновления для начального заполнения регистра. 
// Заполняет даты ремонтов по графикам регламентных мероприятий.
// Параметр "Параметры" добавлен, т.к. он обязательен для отложенных обработчиков. 
Процедура ЗаполнитьРегистрАктуальныхПлановыхДат_ГрафикиРМ(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ПлановыеМероприятияСрезПервых.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ПлановыеМероприятияСрезПервых.ID КАК IDРемонта,
	|	торо_ПлановыеМероприятияСрезПервых.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПервых.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПервых.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПервых
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПервых(, ) КАК торо_ПлановыеМероприятияСрезПервых
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК IDРемонта,
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПоследних
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, ) КАК торо_ПлановыеМероприятияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ГрафикСрезПервых.IDРемонта КАК IDРемонта,
	|	ВТ_ГрафикСрезПервых.СписокОбъектов КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаНачала, ВТ_ГрафикСрезПервых.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаОкончания, ВТ_ГрафикСрезПервых.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДокументОснование, ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки) КАК ДокументОснование,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ГрафикСрезПервых КАК ВТ_ГрафикСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрафикСрезПоследних КАК ВТ_ГрафикСрезПоследних
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = ВТ_ГрафикСрезПоследних.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта ЕСТЬ NULL
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК IDРемонта,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_СкользящиеПланы
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ
	|					ВТ_ДатыИсходные.IDРемонта КАК IDРемонта
	|				ИЗ
	|					ВТ_ДатыИсходные КАК ВТ_ДатыИсходные)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование) КАК ДокументОснование,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КрайняяДатаЗавершения
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписатьВыборкуВРегистрСОбработкойОшибок(Выборка, Параметры);
	
КонецПроцедуры

// Используется в крупных обработчиках обновления.
// Названия полей выборки должны совпадать с полями регистра.
Процедура ЗаписатьВыборкуВРегистрСОбработкойОшибок(Выборка, Параметры)
	
	КоличествоЗаписейВТранзакции = 1000;
	Счетчик = 0;
	
	ШаблонОшибки = НСтр("es='La falta a la anotación en el registro ""las fechas Actuales planificadas"" de la fecha de la reparación %1 (el documento del comienzo de la cadenita %2): %3';ru='Ошибка при записи в регистр ""Актуальные плановые даты"" даты ремонта %1 (документ начала цепочки %2): %3';en='Error while writing to the register ""Actual planned dates"" repair date%1 (document beginning the chain%2):%3'");
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ТранзакцияАктивна() Тогда
			НачатьТранзакцию();
		КонецЕсли;
		
		Запись = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Попытка
			Запись.Записать(Истина);
		Исключение
			ЗафиксироватьТранзакцию();
			Счетчик = 0;
			
			ОписаниеОшибки = ОписаниеОшибки();
			ТекстОшибки = СтрШаблон(ШаблонОшибки, Выборка.IDРемонта, Выборка.ДокументНачалаЦепочки, ОписаниеОшибки);				
			ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
			
			НачатьТранзакцию();
		КонецПопытки;
		
		Счетчик = Счетчик + 1;
		
		Если Счетчик = КоличествоЗаписейВТранзакции Тогда
			ЗафиксироватьТранзакцию();
			Счетчик = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Функция ПолучитьМассивIDРемонтов(Источник)
	
	СтруктураВозврата = Новый Структура;
	
	МассивID = Новый Массив;
	ТаблицаРемонтов = Новый ТаблицаЗначений;
	ТаблицаРемонтов.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка"));
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		
		ТаблицаРемонтов = Источник.ПолучитьТаблицуРемонтовСОсновным();
		МассивID = ТаблицаРемонтов.ВыгрузитьКолонку("ID");
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
		
		МассивID = Источник.ЗакрываемыеРемонты.ВыгрузитьКолонку("ID");
		МассивIDПоЗаявкам = Источник.ЗакрываемыеЗаявки.ВыгрузитьКолонку("ИДРемонта"); 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивID, МассивIDПоЗаявкам, Истина);
		
		Для каждого ИДремонта из МассивID Цикл
			НоваяСтрока = ТаблицаРемонтов.Добавить();
			НоваяСтрока.ID = ИДремонта;
		КонецЦикла;
				
	Иначе
		
		ИмяТЧРемонтов = торо_Ремонты.ПолучитьИмяТЧРемонтов(Источник.Ссылка);
		Если ИмяТЧРемонтов = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		МассивID = Источник[ИмяТЧРемонтов].ВыгрузитьКолонку("ID");
		
		Для каждого ИДремонта из МассивID Цикл
			НоваяСтрока = ТаблицаРемонтов.Добавить();
			НоваяСтрока.ID = ИДремонта;
		КонецЦикла;
		
	КонецЕсли;

	СтруктураВозврата.Вставить("МассивID", МассивID);
	СтруктураВозврата.Вставить("ТаблицаРемонтов", ТаблицаРемонтов);
	
	Возврат СтруктураВозврата;	
	
КонецФункции

Процедура УстановитьУправляемыеБлокировкиНаРегистрАктуальныхДат(ТаблицаРемонтов)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов");
	ЭлементБлокировки.ИсточникДанных = ТаблицаРемонтов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("IDРемонта", "ID");
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура УдалитьПлановыеДатыРемонтовПоДокументуНачалаЦепочки(Документ)
	
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот")
		И ТипЗнч(Документ) <> Тип("ДокументСсылка.торо_ВыявленныеДефекты")
		И ТипЗнч(Документ) <> Тип("ДокументСсылка.торо_ПланГрафикРемонта")
		И ТипЗнч(Документ) <> Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК IDРемонта
	|ИЗ
	|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки = &ДокументНачалаЦепочки";
	
	Запрос.УстановитьПараметр("ДокументНачалаЦепочки", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
		Запись.IDРемонта = Выборка.IDРемонта;
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьАктуальныеПлановыеДатыРемонтов(МассивID, ИсточникСсылка, ТекущиеЗаписиРегистра)
	
	ВыборкаВД = Неопределено;
	ВыборкаППР = Неопределено;
	ВыборкаРМ = Неопределено;
	
	Если ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот")
		ИЛИ ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		
		ВыборкаВД = ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД(МассивID);
		
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		
		ВыборкаППР = ВычислитьАктуальныеПлановыеДатыРемонтовПоППР(МассивID);
		
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
		
		ВыборкаРМ = ВычислитьАктуальныеПлановыеДатыРемонтовПоГрафикамРМ(МассивID);
		
	ИначеЕсли ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")
		ИЛИ ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") 
		ИЛИ ТипЗнч(ИсточникСсылка) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
		
		ВыборкаВД = ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД(МассивID);
		ВыборкаППР = ВычислитьАктуальныеПлановыеДатыРемонтовПоППР(МассивID);
		
	Иначе // Скользящий план работ.
		
		ВыборкаВД = ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД(МассивID);
		ВыборкаППР = ВычислитьАктуальныеПлановыеДатыРемонтовПоППР(МассивID);
		ВыборкаРМ = ВычислитьАктуальныеПлановыеДатыРемонтовПоГрафикамРМ(МассивID);
		
	КонецЕсли;

	Если ВыборкаВД <> Неопределено Тогда
		ЗаписатьИзмененныеПлановыеДатыРемонтов(ВыборкаВД, ТекущиеЗаписиРегистра);
	КонецЕсли;
	
	Если ВыборкаППР <> Неопределено Тогда
		ЗаписатьИзмененныеПлановыеДатыРемонтов(ВыборкаППР, ТекущиеЗаписиРегистра);
	КонецЕсли;
	
	Если ВыборкаРМ <> Неопределено Тогда
		ЗаписатьИзмененныеПлановыеДатыРемонтов(ВыборкаРМ, ТекущиеЗаписиРегистра);
	КонецЕсли;
	
КонецПроцедуры

Функция ВычислитьАктуальныеПлановыеДатыРемонтовПоВОиВД(МассивID)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВнешниеОснованияДляРабот.ID КАК IDРемонта,
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ВнешниеОснования
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|ГДЕ
	|	торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|	И торо_ВнешниеОснованияДляРабот.ID В(&МассивID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК IDРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_ВыявленныеДефектыСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания,
	|	торо_ВыявленныеДефектыСрезПоследних.КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_Дефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты) КАК торо_ВыявленныеДефектыСрезПоследних
	|ГДЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ID В(&МассивID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВнешниеОснования.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ВнешниеОснования.IDРемонта КАК IDРемонта,
	|	ВТ_ВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Дефекты.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Дефекты.ДатаОкончания ЕСТЬ NULL
	|				И ВТ_Дефекты.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Дефекты.ДатаОкончания
	|		ИНАЧЕ ВТ_ВнешниеОснования.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_Дефекты.ДокументНачалаЦепочки, ВТ_ВнешниеОснования.ДокументНачалаЦепочки) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дефекты КАК ВТ_Дефекты
	|		ПО ВТ_ВнешниеОснования.IDРемонта = ВТ_Дефекты.IDРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Дефекты.ДокументНачалаЦепочки,
	|	ВТ_Дефекты.IDРемонта,
	|	ВТ_Дефекты.ОбъектРемонта,
	|	ВТ_Дефекты.ДатаНачала,
	|	ВТ_Дефекты.ДатаОкончания,
	|	ВТ_Дефекты.КрайняяДатаЗавершения,
	|	ВТ_Дефекты.ДокументНачалаЦепочки
	|ИЗ
	|	ВТ_Дефекты КАК ВТ_Дефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	|		ПО ВТ_Дефекты.IDРемонта = ВТ_ВнешниеОснования.IDРемонта
	|ГДЕ
	|	ВТ_ВнешниеОснования.IDРемонта ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";
	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	Запрос.Выполнить();
	
	СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаНачала, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ЕСТЬNULL(ВТ_Заявки.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала))) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаОкончания, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ЕСТЬNULL(ВТ_Заявки.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания))) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.КрайняяДатаЗавершения, ВТ_ДатыИсходные.КрайняяДатаЗавершения) КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДокументОснование, ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ЕСТЬNULL(ВТ_Заявки.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование))) КАК ДокументОснование
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановочныеРемонты КАК ВТ_ОстановочныеРемонты
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_ОстановочныеРемонты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Возврат Выборка;
	
КонецФункции

Функция ВычислитьАктуальныеПлановыеДатыРемонтовПоППР(МассивID)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ID КАК IDРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	торо_ПлановыеРемонтныеРаботыСрезПервых.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПервых
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПервых(
	|			,
	|			ID В (&МассивID)
	|				И Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПервых
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК IDРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПоследних
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&МассивID)
	|					И Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	|				ИЛИ Регистратор ССЫЛКА Документ.торо_ЗакрытиеЗаявокИРемонтов) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ГрафикСрезПервых.IDРемонта КАК IDРемонта,
	|	ВТ_ГрафикСрезПервых.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаНачала, ВТ_ГрафикСрезПервых.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаОкончания, ВТ_ГрафикСрезПервых.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДокументОснование, ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки) КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ГрафикСрезПервых КАК ВТ_ГрафикСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрафикСрезПоследних КАК ВТ_ГрафикСрезПоследних
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = ВТ_ГрафикСрезПоследних.IDРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";
	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	Запрос.Выполнить();
	
	СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаНачала, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ЕСТЬNULL(ВТ_Заявки.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала))) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДатаОкончания, ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ЕСТЬNULL(ВТ_Заявки.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания))) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.КрайняяДатаЗавершения, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайняяДатаЗавершения,
	|	ЕСТЬNULL(ВТ_ОстановочныеРемонты.ДокументОснование, ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ЕСТЬNULL(ВТ_Заявки.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование))) КАК ДокументОснование
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановочныеРемонты КАК ВТ_ОстановочныеРемонты
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_ОстановочныеРемонты.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Возврат Выборка;
	
КонецФункции

Функция ВычислитьАктуальныеПлановыеДатыРемонтовПоГрафикамРМ(МассивID)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ПлановыеМероприятияСрезПервых.Регистратор КАК ДокументНачалаЦепочки,
	|	торо_ПлановыеМероприятияСрезПервых.ID КАК IDРемонта,
	|	торо_ПлановыеМероприятияСрезПервых.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПервых.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПервых.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПервых
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПервых(, ID В (&МассивID)) КАК торо_ПлановыеМероприятияСрезПервых
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК IDРемонта,
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ГрафикСрезПоследних
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, ID В (&МассивID)) КАК торо_ПлановыеМероприятияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ГрафикСрезПервых.IDРемонта КАК IDРемонта,
	|	ВТ_ГрафикСрезПервых.СписокОбъектов КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаНачала, ВТ_ГрафикСрезПервых.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДатаОкончания, ВТ_ГрафикСрезПервых.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ГрафикСрезПоследних.ДокументОснование, ВТ_ГрафикСрезПервых.ДокументНачалаЦепочки) КАК ДокументОснование,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_ДатыИсходные
	|ИЗ
	|	ВТ_ГрафикСрезПервых КАК ВТ_ГрафикСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрафикСрезПоследних КАК ВТ_ГрафикСрезПоследних
	|		ПО ВТ_ГрафикСрезПервых.IDРемонта = ВТ_ГрафикСрезПоследних.IDРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК IDРемонта,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_СкользящиеПланы
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ
	|					ВТ_ДатыИсходные.IDРемонта КАК IDРемонта
	|				ИЗ
	|					ВТ_ДатыИсходные КАК ВТ_ДатыИсходные)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыИсходные.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ВТ_ДатыИсходные.IDРемонта КАК IDРемонта,
	|	ВТ_ДатыИсходные.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаНачала, ВТ_ДатыИсходные.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДатаОкончания, ВТ_ДатыИсходные.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_СкользящиеПланы.ДокументОснование, ВТ_ДатыИсходные.ДокументОснование) КАК ДокументОснование,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КрайняяДатаЗавершения
	|ИЗ
	|	ВТ_ДатыИсходные КАК ВТ_ДатыИсходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкользящиеПланы КАК ВТ_СкользящиеПланы
	|		ПО ВТ_ДатыИсходные.IDРемонта = ВТ_СкользящиеПланы.IDРемонта";

	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Возврат Выборка;

КонецФункции

// Принимает на вход менеджер временных таблиц, в котором должна уже быть создана 
// временная таблица ВТ_ДатыИсходные с колонкой IDРемонта для выполнения отбора.
// Добавляет временные таблицы ВТ_Заявки, ВТ_ОстановочныеРемонты, ВТ_СкользящиеПланы.
Процедура СоздатьВременныеТаблицыПоПриоритетнымДокументамПлана(МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта
	|ПОМЕСТИТЬ ВТ_ЗаявкиРегистраторы
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	|			,
	|			IDРемонта В
	|				(ВЫБРАТЬ
	|					ВТ_ДатыИсходные.IDРемонта КАК IDРемонта
	|				ИЗ
	|					ВТ_ДатыИсходные КАК ВТ_ДатыИсходные)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗаявкиРегистраторы.ДокументОснование КАК ДокументОснование,
	|	ВТ_ЗаявкиРегистраторы.IDРемонта КАК IDРемонта,
	|	торо_ЗаявкиПоРемонтам.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	торо_ЗаявкиПоРемонтам.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	ВТ_ЗаявкиРегистраторы КАК ВТ_ЗаявкиРегистраторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО ВТ_ЗаявкиРегистраторы.ДокументОснование = торо_ЗаявкиПоРемонтам.Регистратор
	|			И ВТ_ЗаявкиРегистраторы.IDРемонта = торо_ЗаявкиПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО ВТ_ЗаявкиРегистраторы.ДокументОснование = торо_ОтмененныеЗаявки.Заявка
	|			И ВТ_ЗаявкиРегистраторы.IDРемонта = торо_ОтмененныеЗаявки.ИДРемонта
	|ГДЕ
	|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDРемонта,
	|	торо_ОстановочныеРемонтыСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_ОстановочныеРемонтыСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ОстановочныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
	|			,
	|			IDЗависимого В
	|				(ВЫБРАТЬ
	|					ВТ_ДатыИсходные.IDРемонта КАК IDРемонта
	|				ИЗ
	|					ВТ_ДатыИсходные КАК ВТ_ДатыИсходные)) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	торо_ОстановочныеРемонтыСрезПоследних.Отвязан = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.Регистратор КАК ДокументОснование,
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК IDРемонта,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаНачалаРемонта КАК ДатаНачала,
	|	торо_СкользящийПланРаботСрезПоследних.ДатаОкончанияРемонта КАК ДатаОкончания,
	|	торо_СкользящийПланРаботСрезПоследних.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения
	|ПОМЕСТИТЬ ВТ_СкользящиеПланы
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ
	|					ВТ_ДатыИсходные.IDРемонта КАК IDРемонта
	|				ИЗ
	|					ВТ_ДатыИсходные КАК ВТ_ДатыИсходные)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаписатьИзмененныеПлановыеДатыРемонтов(Выборка, ТекущиеЗаписиРегистра)
	
	Пока Выборка.Следующий() Цикл
		НужноЗаписать = Истина;
		ТекущаяЗапись = ТекущиеЗаписиРегистра.Найти(Выборка.IDРемонта, "IDРемонта");
		
		Если ТекущаяЗапись <> Неопределено 
			И ТекущаяЗапись.ДатаНачала = Выборка.ДатаНачала
			И ТекущаяЗапись.ДатаОкончания = Выборка.ДатаОкончания
			И ТекущаяЗапись.КрайняяДатаЗавершения = Выборка.КрайняяДатаЗавершения
			И ТекущаяЗапись.ДокументОснование = Выборка.ДокументОснование
			И ТекущаяЗапись.ДокументНачалаЦепочки = Выборка.ДокументНачалаЦепочки Тогда
			НужноЗаписать = Ложь;
		КонецЕсли;
			
		Если НужноЗаписать Тогда	
			Запись = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
